app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaa"], ["body", "aaa"], ["created_at", "2020-06-26 12:18:42.037758"], ["updated_at", "2020-06-26 12:18:42.037758"], ["user_id", 1]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
       flash[:notice] = "Book was successfully created."
       redirect_to book_path(@book.id)
    else
      @books = Book.all